# -*- coding:utf-8 -*-
# @Time : 2021/12/30 11:22 PM
# @Author: jonas.jiang
# @File : demo2.py
print('星期天', '今日')
print('--------------------------------------------')
print('0时', '1时', '2时', '3时', '4时', '5时', '6时')
print('1C ', '1C ', '1C', '1C ', '1C ', '1C', '1C ')
print('--------------------------------------------')
print('星期一', '     2-21', '     1/2')
print('星期二', '     2-22', '     1/2')
print('星期三', '     2-23', '     1/2')
print('星期四', '     2-24', '     1/2')
print('星期五', '     2-25', '     1/2')
